'use strict';

window.onload = function () {
  /*
   - '*'      document.write('*');
   - 개행      document.write('<br>');
   - space    document.write('&nbsp;'); 
   - 가로선     document.write('<hr>');
   */
  //
  /*
    1] 정사각형
    *****
    *****
    *****
    *****
    *****
  */
  /*
    2] 삼각형1
    *
    **
    ***
    ****
    *****
  */
  /*
    3] 삼각형1-reverse
    *****
    ****
    ***
    **
    *
  */
  /*
    4] 삼각형2
        *
       **
      ***
     ****
    *****
  */
  /*
    5] 삼각형2-reverse
    *****
     ****
      ***
       **
        *
  */
  /*
    5] 정삼각형
        *
       ***
      *****
     ******* 
    ********* 
  */
  /*
    5] 정삼각형-reverse
    ********* 
     ******* 
      *****
       ***
        *
  */
  /*
    5] 다이아몬드
        *
       ***
      *****
     ******* 
    ********* 
     ******* 
      *****
       ***
        *
  */
};
